[M_Ep2_Henchman MissionDefinition]
MissionDescription="After Handsome Jack left you for dead in [place]Windshear Waste[-place], you escaped the cold and met a CL4P-TP steward bot -- the last of his kind on Pandora. He has enlisted you as his minion; you are to help him kill Jack and save Pandora.<br><br>Before you can do any of that, however, you will need to deal with a slightly more pressing matter: Claptrap's eye has been ripped out by a bullymong, and you must help him retrieve it."

[M_Ep2_Henchman:FindEye1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Get Claptrap's eye back."

[M_Ep2_Henchman:ReturnClaptrapsEyeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've killed Knuckle Dragger, who stole Claptrap's eye. Now you just need to find someone to fix Claptrap up."


[M_Ep2b_Henchman MissionDefinition]
MissionDescription="Sir Hammerlock has suggested that, if you're expecting to leave [place]Southern Shelf[-place] alive, you'll need a better shield. He wants you to head to an abandoned shop and former Crimson Raider base. Once there, you can purchase a better shield."
MissionSummary="Head to the abandoned Crimson Raider base."

[M_Ep2b_Henchman:BreakingTheFenceSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock sent you to a former Crimson Raider safehouse in search of a better shield. Unfortunately, the elevator up to the safehouse is missing a fuse. You've found a compatible fuse behind an active electric field -- if you can disable the field, you can grab the fuse."

[M_Ep2b_Henchman:FusePluggedInSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock sent you to a former Crimson Raider safehouse in search of a better shield. Unfortunately, the elevator up to the safehouse is missing a fuse. You've found a compatible one, however. Claptrap has instructed you to plug the fuse into the elevator so you can head up and grab a shield."

[M_Ep2b_Henchman:GetFuseSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock sent you to a former Crimson Raider safehouse in search of a better shield. Unfortunately, the elevator up to the safehouse is missing a fuse. Perhaps you can find a replacement in the nearby bandit camp."

[M_Ep2b_Henchman:PilferShieldSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock sent you to a former Crimson Raider safehouse in search of a better shield. Now that you've got the safehouse elevator working again, there's nothing to stop you from heading up and grabbing a new shield for yourself."

[M_Ep2b_Henchman:RunThroughFence MissionObjectiveDefinition]
ProgressMessage="Run through fence"

[M_Ep2c_Henchman MissionDefinition]
MissionDescription="Now that his minion (that's you!) is well-armed and raring for a fight, Claptrap feels it is time for you and him to head to [place]Sanctuary[-place] -- the last free town on Pandora. In order to reach [place]Sanctuary[-place], you'll need to steal Claptrap's boat back from the nefarious Captain Flynt. One obstacle stands between you and Flynt, however: Flynt's henchman, an explosives expert named Boom Bewm."
TurnInDescription="By killing Captain Flynt, you have increased the average literacy of the entire area by a factor of ten. Now nothing stands between you and a frigid, fifteen-hour boat ride with Claptrap. 'Grats!"

[M_Ep2c_Henchman:BoardClaptrapsBoatSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Now that his minion (that's you!) is well-armed and raring for a fight, Claptrap feels it is time for you and him to head to [place]Sanctuary[-place] -- the last free town on Pandora. Captain Flynt, a bandit leader, held the keys to Claptrap's ship until you killed the hell out of him. Now that you've got the keys, you and Claptrap can sail to [place]Sanctuary[-place] and join the resistance against Handsome Jack."

[M_Ep2c_Henchman:CatchupToClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to reach [place]Sanctuary[-place], you'll need to steal Claptrap's boat back from the nefarious Captain Flynt. One obstacle stands between you and Flynt, however: Flynt's henchman, an explosives expert named Boom Bewm. After a mishap with Boom Bewm's cannon, Claptrap was blasted into the wild blue yonder. You'll have to catch up to him."

[M_Ep2c_Henchman:EquipGrenadeMod_Set MissionObjectiveSetDefinition]
MissionDescriptionOverride="Boom Bewm is dead; long live Boom Bewm. Claptrap has asked you to equip the grenade mod Mr. Boom dropped before his untimely demise so you will be better prepared for the assault on Captain Flynt's ship."

[M_Ep2c_Henchman:FindHellfistSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Captain Flynt, a bandit leader, holds the keys to Claptrap's ship. If you want to make it to [place]Sanctuary[-place], you'll need to kill him and snag his keys."

[M_Ep2c_Henchman:FireClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to reach [place]Sanctuary[-place], you'll need to steal Claptrap's boat back from the nefarious Captain Flynt. With Boom Bewm dead, you and Claptrap have found yourselves utterly defeated by a locked gate. Luckily, Claptrap has an idea: get into Boom Bewm's old cannon and blast the gate down."

[M_Ep2c_Henchman:ProceedToHellfistSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to reach [place]Sanctuary[-place], you'll need to steal Claptrap's boat back from the nefarious Captain Flynt, who holds the keys to Claptrap's ship. If you want to make it to [place]Sanctuary[-place], you'll need to kill him and snag his keys."
